# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/core"

brew "git"
brew "autojump"

# Version manager used for Ruby and Elixir.
brew "asdf"

# May need to re-run `brew install vim` after installing Ruby with e.g. `asdf install ruby 2.6.5; asdf global ruby 2.6.5`, so it's compiled against the right Ruby.
# If https://github.com/asdf-vm/asdf/pull/575 is merged, try using that in the command above (to get latest Ruby without hard-coding a number into this file).
brew "vim"

# Find more with `brew search my_guess_at_the_name`.
cask "iterm2"
cask "zoomus"  # https://zoom.us
cask "firefox"
cask "vagrant"
cask "virtualbox"

# Mac App Store
# "Copy Link" from the App Store UI to get the ID.
mas "1Password", id: 1333542190
mas "Slack", id: 803453959
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Xcode", id: 497799835
mas "Trello", id: 1278508951
mas "Telegram", id: 747648890
